{
  "name": "Harvest",
  "description": "Autonomous trading bot on Solana. Hunts airdrops, flips NFTs, farms yield, and stakes tokens—all automated, all profitable.",
  "repoLink": "https://github.com/0xNoushad/harvest",
  "solanaIntegration": "Harvest executes on-chain transactions via @solana/web3.js and @solana/spl-token. Integrates with Jupiter Swap API for token swaps, Magic Eden API for NFT trading, Marinade Finance for liquid staking (mSOL), Kamino and MarginFi for yield farming deposits, and Drift Protocol for perpetuals. Uses Helius RPC for reliable transaction submission with priority fees. All wallet operations use Ed25519 keypairs with Fernet encryption. Tracks positions and performance in local state, with all trades verified on-chain via transaction signatures.",
  "problemStatement": "Solana DeFi users miss 80% of airdrop opportunities, lose 15-30% on NFT flips due to delayed execution, and leave capital idle earning 0% when 7-18% APY is available across protocols. Manual monitoring requires checking 8+ websites for airdrops, watching Magic Eden floor prices 24/7, and manually rebalancing across Kamino, Marinade, and MarginFi. Users with <10 SOL can't justify the time cost. Harvest solves this by running 7 autonomous strategies 24/7, making AI-powered decisions via Groq LLM, and executing trades instantly—turning small capital into meaningful returns without constant attention.",
  "technicalApproach": "Python-based autonomous agent with 7 strategy modules (airdrop_hunter, airdrop_claimer, yield_farmer, liquid_staking, nft_flipper, arbitrage, bounty_hunter). Main loop runs every 60 seconds: scanner checks all strategies for opportunities, Groq LLM evaluates each opportunity with full context (balance, risk, historical performance), risk_manager validates against position limits and stop-losses, then executes via Solana RPC. Wallet management uses Fernet-encrypted Ed25519 keys with password protection. Integrations: Jupiter API for swap quotes and execution, Magic Eden API for NFT floor prices and listings, Helius RPC for transaction submission with retry logic, CoinGecko for price data. Telegram bot provides real-time notifications and user control (pause/resume, manual approval modes). Performance tracking calculates profit/loss, win rate, and 2% performance fees. All transactions signed locally and submitted with priority fees for fast confirmation.",
  "targetAudience": "Solana users with 0.5-10 SOL ($50-$1000) who want to grow their capital but can't justify full-time trading. Specifically: crypto-curious users who bought SOL but don't know how to earn yield, side-hustlers who want passive income without learning DeFi protocols, airdrop farmers who manually check websites daily, and small traders who miss opportunities while sleeping. They currently either leave funds idle in Phantom wallet (0% returns) or manually check opportunities 2-3 times per day, missing 70%+ of profitable trades. Harvest runs 24/7 via Telegram, requires zero DeFi knowledge, and turns $1 into $10-20 in 30 days through automated airdrop claims, yield farming, and NFT flips.",
  "businessModel": "2% performance fee on profits only (no fee on losses). Users fund wallet with SOL, bot trades autonomously, fees deducted from winning trades. At 1000 active users averaging $500 capital with 10% monthly returns = $50k monthly profit = $1k in fees. Revenue scales with user count and capital. Free tier: all strategies enabled, manual approval required. Pro tier ($9/mo): ALWAYS mode for trusted strategies, priority execution, advanced analytics. Additional revenue: Telegram bot API ($29/mo for developers), white-label licensing for protocols ($499/mo), and affiliate fees from Jupiter/Magic Eden integrations (0.1% of volume). Target: 10k users in 6 months = $20k/mo in performance fees + $50k/mo in subscriptions.",
  "competitiveLandscape": "Existing solutions are fragmented: Kamino automates single-protocol yield but can't claim airdrops or flip NFTs. Jupiter DCA handles scheduled swaps but no conditional logic or multi-strategy execution. Hawksight offers yield optimization but only for their vaults, not cross-protocol. Airdrop trackers (Airdropped.link, Drops.bot) require manual claiming. NFT trading bots (Tensor, Sniper) focus only on NFTs, not holistic portfolio management. No tool combines airdrop hunting + NFT flipping + yield farming + liquid staking in one autonomous agent with AI decision-making. Harvest is the first all-in-one autonomous money hunter for Solana—7 strategies, 1 bot, 24/7 execution, accessible via Telegram with zero DeFi knowledge required.",
  "futureVision": "V2 (3 months): Multi-wallet support for managing multiple users, web dashboard for analytics, strategy marketplace where users share/fork automation rules. V3 (6 months): Cross-chain via Wormhole (hunt opportunities on Ethereum, Base, Arbitrum), social trading (copy top performers' strategies), mobile app with push notifications. Long-term: Raise seed round ($500k-1M) to build full-time team, integrate with 20+ Solana protocols (Drift perpetuals, Sanctum LST arbitrage, Meteora LPs), launch $HARVEST governance token for fee sharing and strategy voting. Goal: 100k users, $50M+ in managed capital, become the default autonomous trading layer for Solana—the 'Yearn Finance meets AI agent' for the Solana ecosystem.",
  "liveAppLink": "https://t.me/Hrvestbot",
  "presentationLink": "https://x.com/0xNoushad/status/2022303088514932993",
  "twitterHandle": "@harvest_bot",
  "telegramHandle": "@Hrvestbot",
  "tags": ["defi", "ai", "trading"]
}
